### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=4ac94881cf28678fd719534880558c2125ca2ec7]
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=7dd285c14cf8bfd9d9a0bd995c4aab13cf301da7]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/14512061520513425405]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=378809033]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=9ccd9fb9-fc8a-41e3-8ce3-dac02e72bdc1]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-10-09T13:38:35Z" -> (known after apply)
      ~ disk                 = 200 -> (known after apply)
      ~ id                   = "378809033" -> (known after apply)
      ~ ipv4_address         = "104.248.138.84" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      ~ price_hourly         = 0.125 -> (known after apply)
      ~ price_monthly        = 84 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:378809033" -> (known after apply)
      ~ user_data            = "b59feff8d9f993a4b3baf9d9f83bf370d4db5ca2" -> "f1546d85dfa54bdb6863930d631e2919e34d3759" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 378809033,
        ] -> (known after apply)
        id              = "9ccd9fb9-fc8a-41e3-8ce3-dac02e72bdc1"
        name            = "forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:378809033",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "104.248.138.84",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>